tap "homebrew/bundle"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Improved top (interactive process viewer)
brew "htop"
# Fast, highly customisable system info script
brew "neofetch"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Prompt theme engine for any shell
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
vscode "adpyke.codesnap"
vscode "alefragnani.project-manager"
vscode "alexanderte.dainty-dark-plus-vscode"
vscode "bierner.markdown-preview-github-styles"
vscode "Catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "DavidAnson.vscode-markdownlint"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.vscode-pull-request-github"
vscode "Gruntfuggly.todo-tree"
vscode "IBM.output-colorizer"
vscode "illixion.vscode-vibrancy-continued"
vscode "James-Yu.latex-workshop"
vscode "JeffersonQin.latex-snippets-jeff"
vscode "kamilturek.vscode-pyproject-toml-snippets"
vscode "KevinRose.vsc-python-indent"
vscode "maciejdems.add-to-gitignore"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.autopep8"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "njpwerner.autodocstring"
vscode "njqdev.vscode-python-typehint"
vscode "PKief.material-icon-theme"
vscode "ravioshankar.devops-toolbox"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.LiveServer"
vscode "tecosaur.latex-utilities"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vsls-contrib.gitdoc"
vscode "waderyan.gitblame"
vscode "wayou.vscode-todo-highlight"
vscode "WeidaWang.quick-python-print"
vscode "WollaceBuarque.tailwind-theme"
vscode "yzhang.markdown-all-in-one"
vscode "ziyasal.vscode-open-in-github"
